
''' 
	Hadoop:
	1.Apache开源组织的分布式计算框架
	2.核心设计：
		a.MapReduce and HDFS(hadoop Distributed File System)
		b.思想：任务的分解与结果的汇总
		c.Input -> splitting -> Mapping -> Shuffing -> Reducing -> Final result
	_________________________________________________________________
	|	Intel Hadoop manager 										|
	|	安装、部署、配置、监控、告警和访问控制								|
	|_______________________________________________________________|
	|  			| Mahout	| Pig 		  | Hive		| 			|
	| Sqoop		| 数据挖掘	| 数据流处理语言 |	数据仓库		| 			|
	| 			|___________|_____________|_____________|			|
	| 关系型数据	| MapReduce                             | 			|
	|  ETL工具	| 分布式计算框架                           | ZooKeeper	|
	|___________|_______________________________________|			|
	| 			| HBase 								| 分布式协作	|
	| 			| 实时、分布式、高纬度数据库					|	服务		|
	|	Flume	|_______________________________________|			|
	| 日志收集工具	| HDFS									|			|
	|			| 分布式文件系统							|			|
	|___________|_______________________________________|___________|

	实现方式：
	一.Linux的管道操作
	二.Hadoop Streaming & mjjob:
		1.Java:效率高、部署方便
		2.Hadoop Streaming 是Hadoop 提供的编程工具：允许用户使用可执行文件或者脚本文件作为 Mappper和Reducer
	


'''
